text.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-01-05 So. 17:48 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>text</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Harry R. Schwartz" />
</head>
<body>
<div id="content">
<h1 class="title">text</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf5cc079">1. Was ist modulare Arithmetik?</a></li>
<li><a href="#org7abee2b">2. Was ist modulo rechnen</a></li>
<li><a href="#org1ea2302">3. Was kann man nun damit machen?</a></li>
<li><a href="#orgee17324">4. Wieso sind modulo Primzahlen intersssant für die Verschlüsslung</a></li>
<li><a href="#org4c71c53">5. Was ist ein Generator?</a></li>
<li><a href="#orgd2a9deb">6. Wie Funktioniert Diffie-Hellmann schematisch?</a></li>
<li><a href="#orgdc4a7c9">7. Wieso ist es einfacher hochzurechenen als logarithmen zu berechnen?</a></li>
<li><a href="#org6a80e63">8. Wie Funktioniert die El Gamal verschlüsselung</a></li>
<li><a href="#orgbba7b1a">9. Wieso ist RSA einfacher?</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgf5cc079" class="outline-2">
<h2 id="orgf5cc079"><span class="section-number-2">1</span> Was ist modulare Arithmetik?</h2>
<div class="outline-text-2" id="text-1">
<p>
Die Modulare Arithmetik beruht darauf, das man sich eine Primzahl sucht und mit
dieser Zahl und einer Zahlenmenge von dieser Zahl - 1. Ich werde in den
folgenden Teilen diese Zahl m nennen. Die grosse Frage ist ja aber, was ist
modulo.
</p>
</div>
</div>

<div id="outline-container-org7abee2b" class="outline-2">
<h2 id="org7abee2b"><span class="section-number-2">2</span> Was ist modulo rechnen</h2>
<div class="outline-text-2" id="text-2">
<p>
Modulo rechenen beschreibt das Rechnen mit Resten. So Wird beim dividieren einer
Zahl keine Kommastellen angefangen sondern einfach der Rest Notiert. Dies ist
auch das Resultat einer Modulo Rechnung.
</p>

<p>
Die Notation einer modulo Rechnung wird in Programmiersprache mit einem Prozent
zeichen angegeben. Beispiel: 7 % 3 = 1 &lt;br&gt;
Die Notation in der Mathematik ist sehr àhnlich. Beispiel: 8mod3 = 2. Allerdings
wird das Gleichheitszeichen häufig durch ein Kongruenzzeichen ersetzt. Die
Schreibweise ist eigentlich ein Gleichheitszeichen, mit dem Unterschied, das es
aus drei Strichen besteht.
</p>
</div>
</div>

<div id="outline-container-org1ea2302" class="outline-2">
<h2 id="org1ea2302"><span class="section-number-2">3</span> Was kann man nun damit machen?</h2>
<div class="outline-text-2" id="text-3">
<p>
Wir nehemen eine Primzahl m die möglichst gross ist, damit es viele Möglichkeiten
gibt. Anschliessend definiert man eine Zahlenmengen Zm die von null bis m-1
geht. Anschliessend suchen wir eine Zahl x die möglichst viele Resultate
produziert. Die Grösste Zahl die x sein kann ist m/2-1.
</p>
</div>
</div>

<div id="outline-container-orgee17324" class="outline-2">
<h2 id="orgee17324"><span class="section-number-2">4</span> Wieso sind modulo Primzahlen intersssant für die Verschlüsslung</h2>
<div class="outline-text-2" id="text-4">
<p>
Wenn man die Nachricht mit dem Schlüssel entschlüsselt, und das ganze im
Binärsystem macht, ist man spätestens nach 2r Multiplikationen fertog, wobei r
die Anzahl der Binärziffern ist. Das Interessante das ganze im Binärsystem zu
machen ist, das man die Quadrierungen zu Multiplikationen umwandeln kann.
</p>
</div>
</div>

<div id="outline-container-org4c71c53" class="outline-2">
<h2 id="org4c71c53"><span class="section-number-2">5</span> Was ist ein Generator?</h2>
<div class="outline-text-2" id="text-5">
<p>
Der Generator ist die Zahl die deren alle Reste von Modulo abdecken.
</p>
</div>
</div>

<div id="outline-container-orgd2a9deb" class="outline-2">
<h2 id="orgd2a9deb"><span class="section-number-2">6</span> Wie Funktioniert Diffie-Hellmann schematisch?</h2>
</div>

<div id="outline-container-orgdc4a7c9" class="outline-2">
<h2 id="orgdc4a7c9"><span class="section-number-2">7</span> Wieso ist es einfacher hochzurechenen als logarithmen zu berechnen?</h2>
</div>

<div id="outline-container-org6a80e63" class="outline-2">
<h2 id="org6a80e63"><span class="section-number-2">8</span> Wie Funktioniert die El Gamal verschlüsselung</h2>
</div>

<div id="outline-container-orgbba7b1a" class="outline-2">
<h2 id="orgbba7b1a"><span class="section-number-2">9</span> Wieso ist RSA einfacher?</h2>
<div class="outline-text-2" id="text-9">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Alice</th>
<th scope="col" class="org-left">Eve</th>
<th scope="col" class="org-left">Bob</th>
<th scope="col" class="org-left">Inventar Alice</th>
<th scope="col" class="org-left">Inventar Eve</th>
<th scope="col" class="org-left">Inventar Bob</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">publik uebertragen</td>
<td class="org-left">g,p</td>
<td class="org-left">&#x2014; g,p &#x2013;&gt;</td>
<td class="org-left">g,p</td>
<td class="org-left">g, p</td>
<td class="org-left">g, p</td>
<td class="org-left">g, p</td>
</tr>

<tr>
<td class="org-left">privat generiert</td>
<td class="org-left">a</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">b</td>
<td class="org-left">g, p, a</td>
<td class="org-left">g, p</td>
<td class="org-left">g, p, b</td>
</tr>

<tr>
<td class="org-left">berechnen</td>
<td class="org-left">g<sup>a</sup></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">g<sup>b</sup></td>
<td class="org-left">g, p, a / g<sup>a</sup></td>
<td class="org-left">g, p</td>
<td class="org-left">g, p, b / g<sup>b</sup></td>
</tr>

<tr>
<td class="org-left">publik uebertragen</td>
<td class="org-left">g<sup>a</sup></td>
<td class="org-left">&#x2014; g<sup>a</sup> &#x2013;&gt;</td>
<td class="org-left">g<sup>a</sup></td>
<td class="org-left">g, p, a / g<sup>a</sup></td>
<td class="org-left">g, p, g<sup>a</sup></td>
<td class="org-left">g, p, a, g<sup>a</sup> / g<sup>b</sup></td>
</tr>

<tr>
<td class="org-left">publik uebertragen</td>
<td class="org-left">g<sup>b</sup></td>
<td class="org-left">&lt;&#x2013; g<sup>b</sup> ---</td>
<td class="org-left">g<sup>b</sup></td>
<td class="org-left">g, p, a, g<sup>b</sup> / g<sup>a</sup></td>
<td class="org-left">g, p, g<sup>a</sup>, g<sup>b</sup></td>
<td class="org-left">g, p, a, g<sup>a</sup> / g<sup>b</sup></td>
</tr>

<tr>
<td class="org-left">berechnen</td>
<td class="org-left">(g<sup>b</sup>)<sup>a</sup></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">(g<sup>a</sup>)<sup>b</sup></td>
<td class="org-left">g, p, a, g<sup>b</sup>, g<sup>ba</sup></td>
<td class="org-left">g, p, g<sup>a</sup>, g<sup>b</sup></td>
<td class="org-left">g, p, a, g<sup>a</sup>, g<sup>ab</sup> / g<sup>b</sup></td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</body>
</html>
